app/controllers/api/events_controller.rb

SELECT "group_events".* FROM "group_events" WHERE "group_events"."deleted" = ?  [["deleted", "f"]]
---
    def index
      @events = GroupEvent.all.where(deleted: false)

SELECT  "group_events".* FROM "group_events" WHERE "group_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_event
      begin
        @event = GroupEvent.find(params[:id])